app/views/projects/index.html.erb

SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (1, 2, 3)
---
                    <ul>
                        <% project.todos.each do |todo| %>