app/views/todos/_form.html.erb

SELECT "projects".* FROM "projects"
---
<%= form_with scope: :todo, url: "/projects/:project_id/todos", local: true, id: "form" do |form| %>
    <%= form.collection_select(:project_id, Project.all, :id, :title) %>