app/controllers/projects_controller.rb

    def index
        @projects = Project.includes(:todos)
---
SELECT "projects".* FROM "projects"
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (1, 2, 3)