app/controllers/todos_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "todos" ("text", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "Купить хлеб"], ["project_id", 1], ["created_at", "2019-11-17 15:33:36.403830"], ["updated_at", "2019-11-17 15:33:36.403830"]]
---
    def create
        @project = Project.find(params[:todo][:project_id])
        @todo = @project.todos.create(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "todos" SET "isCompleted" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["isCompleted", "t"], ["updated_at", "2019-11-18 15:52:26.982299"], ["id", 8]]
---
    def update
        @todo = Todo.find(params[:todo][:id])
        @todo.update(isCompleted: params[:todo][:isCompleted])